app/controllers/customers_controller.rb

SELECT  "customer_details".* FROM "customer_details" WHERE "customer_details"."customer_id" = $1 LIMIT $2  [["customer_id", 5], ["LIMIT", 1]]
---
  def show
    customer_detail = CustomerDetail.find(params[:id])