app/controllers/customers_controller.rb

  def index
    @page = (params[:page] || 0).to_i
    if params[:keywords].present?
      @keywords = params[:keywords]
      customer_search_term = CustomerSearchTerm.new(@keywords)
      @customers = Customer.where(
        customer_search_term.where_clause,
        customer_search_term.where_args).
        order(customer_search_term.order).
        offset(PAGE_SIZE * @page).limit(PAGE_SIZE)
---
SELECT  "customers".* FROM "customers" WHERE (lower(first_name) like 'pat%' OR lower(last_name) like 'pat%' OR lower(email) like 'pat123@somewhere.net') ORDER BY lower(email) = 'pat123@somewhere.net' desc, last_name asc LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]

  def show
    customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]